from .segmentation_dataset import SegmentationDataset


class LuminarSeg(SegmentationDataset):
#     CLASSES = ('路面', '人行道', '泥地', '护栏', '墙体', '建筑', '高空物', '支撑杆', '低空植被',
#            '交通牌', '交通锥', '其他目标', '车或者人', '轮挡', '关闸', '反射噪声',
#            '水雾沙尘', '未知目标',)

#     CLASSES = ('路面', '障碍物', '高空物', '支撑杆', '低空植被', '交通牌', '交通锥', '其他目标',
#            '车或者人', '轮挡', '关闸', '反射噪声',
#            '水雾沙尘', '未知目标',)

    CLASSES = ('路面', '人行道', '障碍物', '高空噪声', '支撑杆', '交通牌', '交通锥',
           '车或者人', '轮挡', '未知目标',)

    PALETTE = [[255, 0, 0], [255, 127, 80], [218, 97, 17],
           [255, 255, 0], [0, 200, 200], [128, 128, 0], [200, 200, 200],
           [107, 142, 35], [0, 255, 127], [152, 251, 152], [100, 60, 255], [142, 0, 252],
           [0, 0, 255], [60, 179, 113], [255, 215, 0], [0, 60, 100],
           [0, 80, 100], [72, 51, 159], [119, 11, 32], [128, 64, 128]]
    # PALETTE = [[255, 0, 0], [255, 127, 80], [0, 255, 127],
    #     [200, 200, 200], [107, 142, 35], [0, 255, 127],
    #     [152, 251, 152], [0, 0, 255], [142, 0, 252], [128, 64, 128]]


    def __init__(self, opt, split):
        super().__init__(opt, split)
